In [2]:
import pandas as pd
import numpy as np

In [4]:
labels=['a','b','c']
my_list=[10,20,50]
arr=np.array([4,5,6])
d={'a':10,'b':23,'c':45} //dictionary
a=pd.Series(d)
a

a    10
b    23
c    45
dtype: int64

In [13]:
pd.Series(data=my_list)  #list

0    10
1    20
2    50
dtype: int64

In [12]:
pd.Series(my_list,labels)  #values,index order

a    10
b    20
c    50
dtype: int64

In [14]:
pd.Series(index=labels,data=my_list)

a    10
b    20
c    50
dtype: int64

In [15]:
pd.Series([sum,print,min])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function min>
dtype: object

In [17]:
s1=pd.Series([10,20],index=['USA','India'])

In [18]:
s1

USA      10
India    20
dtype: int64

In [19]:
#Dataframes

In [20]:
from numpy.random import randn

In [40]:
np.random.seed(10)  ## same seed value gives same random number everytime

In [41]:
np.random.random()

0.771320643266746

In [42]:
np.random.seed(10)
np.random.random()

0.771320643266746

In [43]:
randn(5,4)  #produces array of specified shape

array([[ 0.03777261, -0.13544849, -0.01002595,  1.67080819],
       [-0.66437971, -0.60555494, -0.65099088,  0.51256776],
       [ 0.26238882, -0.58273165,  1.36842193,  0.05336866],
       [ 1.49057364,  0.75636693,  0.46964093, -0.23396259],
       [ 0.35365794,  1.78370094, -0.35030121, -0.9896496 ]])

In [45]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A -0.816974  1.019615 -0.341436  0.751281
B -0.362252 -1.129131 -0.349710 -1.052727
C  1.282277 -0.171805  0.577658 -1.474975
D  0.078788  0.918414 -0.492697  0.096462
E -0.652760 -0.221762 -1.068287 -1.227692

In [46]:
df['W']

A   -0.816974
B   -0.362252
C    1.282277
D    0.078788
E   -0.652760
Name: W, dtype: float64

In [47]:
df[['W','Z']]

          W         Z
A -0.816974  0.751281
B -0.362252 -1.052727
C  1.282277 -1.474975
D  0.078788  0.096462
E -0.652760 -1.227692

In [50]:
df['new']=10  #creating new column
df

          W         X         Y         Z  new
A -0.816974  1.019615 -0.341436  0.751281   10
B -0.362252 -1.129131 -0.349710 -1.052727   10
C  1.282277 -0.171805  0.577658 -1.474975   10
D  0.078788  0.918414 -0.492697  0.096462   10
E -0.652760 -0.221762 -1.068287 -1.227692   10

In [56]:
df.drop('C',axis=0)  #drop row for that axis=0

          W         X         Y         Z  new
A -0.816974  1.019615 -0.341436  0.751281   10
B -0.362252 -1.129131 -0.349710 -1.052727   10
D  0.078788  0.918414 -0.492697  0.096462   10
E -0.652760 -0.221762 -1.068287 -1.227692   10

In [60]:
df.drop('new',axis=1)  #drop column for that axis=1

          W         X         Y         Z
A -0.816974  1.019615 -0.341436  0.751281
B -0.362252 -1.129131 -0.349710 -1.052727
C  1.282277 -0.171805  0.577658 -1.474975
D  0.078788  0.918414 -0.492697  0.096462
E -0.652760 -0.221762 -1.068287 -1.227692

In [62]:
df

          W         X         Y         Z  new
A -0.816974  1.019615 -0.341436  0.751281   10
B -0.362252 -1.129131 -0.349710 -1.052727   10
C  1.282277 -0.171805  0.577658 -1.474975   10
D  0.078788  0.918414 -0.492697  0.096462   10
E -0.652760 -0.221762 -1.068287 -1.227692   10

In [70]:
df.drop('X',axis=1,inplace=True) #original table deletes

In [71]:
df

          W         Y         Z
A -0.816974 -0.341436  0.751281
B -0.362252 -0.349710 -1.052727
C  1.282277  0.577658 -1.474975
D  0.078788 -0.492697  0.096462
E -0.652760 -1.068287 -1.227692

In [72]:
df.loc['A']  //based on alphabet row

W   -0.816974
Y   -0.341436
Z    0.751281
Name: A, dtype: float64

In [73]:
df.iloc[2]  // 3rd row values

W    1.282277
Y    0.577658
Z   -1.474975
Name: C, dtype: float64

In [74]:
df>0

       W      Y      Z
A  False  False   True
B  False  False  False
C   True   True  False
D   True  False   True
E  False  False  False

In [75]:
df[df>0]

          W         Y         Z
A       NaN       NaN  0.751281
B       NaN       NaN       NaN
C  1.282277  0.577658       NaN
D  0.078788       NaN  0.096462
E       NaN       NaN       NaN

In [77]:
df[df['W']>0]

          W         Y         Z
C  1.282277  0.577658 -1.474975
D  0.078788 -0.492697  0.096462

In [79]:
df.reset_index()   #creates default 0,1,2---- indexes  and old index values is like a column

  index         W         Y         Z
0     A -0.816974 -0.341436  0.751281
1     B -0.362252 -0.349710 -1.052727
2     C  1.282277  0.577658 -1.474975
3     D  0.078788 -0.492697  0.096462
4     E -0.652760 -1.068287 -1.227692